src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенПродажи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/РаботаСЦенамиВызовСеревера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьЦенуПродажиНаДату(Номенклатура, Знач ВидЦены = Неопределено, Знач ДатаЦены = Неопределено) Экспорт
	запрос = Новый Запрос;
	запрос.Текст = "
		| ВЫБРАТЬ
		| 	ЦеныНоменклатуры.Цена КАК Цена
		| ИЗ
		| 	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|		&Период,
		|		Номенклатура = &Номенклатура
		|			И ВидЦены = &ВидЦены
		|	) КАК ЦеныНоменклатуры
		|";

	запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	запрос.УстановитьПараметр("Период", ДатаЦены);
	запрос.УстановитьПараметр("ВидЦены", ВидЦены);

	результатЗапроса = запрос.Выполнить();
	Если результатЗапроса.Пустой() Тогда
		Возврат NULL;
	КонецЕсли;

	Возврат результатЗапроса.Выбрать().Следующий().Цена;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
